## [DataFrame의 인덱스 다루기 -2]
- 행인덱스를 정수형 인덱스로 초기화
- 기존 행 인덱스 -> 컬럼으로 추가 시킴[기본값]
- 메서드 : 변수명.reset_index()

In [11]:
# [1] 모듈로딩
import pandas as pd

In [12]:

# 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kore':[89,100,99],
       'eng':[70,80,90],
       'math':[99,88,77]}

In [13]:
# [3] Dict -> DataFrame 형태로 저장
df=pd.DataFrame(jumsu)
df

   name  kore  eng  math
0   마징가    89   70    99
1   태권V   100   80    88
2  원더우먼    99   90    77

In [16]:
# 4. 행인덱스 초기화
df2=df.reset_index()
df2

   index  name  kore  eng  math
0      0   마징가    89   70    99
1      1   태권V   100   80    88
2      2  원더우먼    99   90    77

In [17]:
# 5. 기존의 인덱스번호 삭제하기
df2=df.reset_index(drop=True)
df2

   name  kore  eng  math
0   마징가    89   70    99
1   태권V   100   80    88
2  원더우먼    99   90    77